In [ ]:
--tables creation for customers and the products they are buying.

create table Customers (
    customer_id int primary key autoincrement,
    name varchar(255) not null,
    email varchar(255) unique not null,
    phone varchar(20) unique not null,
    address text,
    created_at timestamp default current_timestamp
);

create table Products (
    product_id int primary key autoincrement,
    name varchar(255) not null,
    category varchar(100) not null,
    price decimal(10,2) not null,
    stock int not null,
    brand varchar(100),
    created_at timestamp default current_timestamp
);

create table Orders (
    order_id int primary key autoincrement,
    customer_id int not null,
    order_date timestamp default current_timestamp,
    total_amount decimal(10,2) not null,
    status string default 'Pending'
    );

create table Order_Items (
    order_item_id int primary key autoincrement,
    order_id int not null,
    product_id int not null,
    quantity int not null,
    price decimal(10,2) not null
    );

    show tables;

In [ ]:
--Alter the table as per the requirement

alter table products drop column price;
alter table products
add column price_inr number(10,2) not null;
alter table products
add column price_usd number(10,2) not null;

alter table Customers add column country varchar(50) not null;

In [ ]:
--Customers data

insert into Customers (name, email, phone, address, country, created_at) values
('Amit Sharma', 'amit.sharma@example.com', '+919876543210', 'Delhi, India', 'India', '2025-01-02 10:00:00'),
('John Smith', 'john.smith@example.com', '+1234567890', 'New York, USA', 'USA', '2025-01-03 11:00:00'),
('Emma Johnson', 'emma.johnson@example.com', '+14031234567', 'Toronto, Canada', 'Canada', '2025-01-04 12:00:00'),
('Ravi Kumar', 'ravi.kumar@example.com', '+918765432109', 'Mumbai, India', 'India', '2025-01-05 13:00:00'),
('Sophia Wilson', 'sophia.wilson@example.com', '+971501234567', 'Dubai, UAE', 'UAE', '2025-01-06 14:00:00'),
('James Davis', 'james.davis@example.com', '+12261234567', 'Los Angeles, USA', 'USA', '2025-01-07 15:00:00'),
('Olivia Martinez', 'olivia.martinez@example.com', '+14161234567', 'Vancouver, Canada', 'Canada', '2025-01-08 16:00:00'),
('Arun Mehta', 'arun.mehta@example.com', '+919845678901', 'Bangalore, India', 'India', '2025-01-09 17:00:00'),
('Lucas Taylor', 'lucas.taylor@example.com', '+61412345678', 'Sydney, Australia', 'Australia', '2025-01-10 18:00:00'),
('Mia Anderson', 'mia.anderson@example.com', '+971555678910', 'Abu Dhabi, UAE', 'UAE', '2025-01-11 19:00:00');

In [ ]:
--Products data

insert into Products (name, category, stock, brand, price_inr, price_usd, created_at) values
('Winter Jacket', 'Clothing', 20, 'North Face', 8000.00, 100.00, '2025-01-02 10:00:00'),
('Running Shoes', 'Footwear', 30, 'Nike', 6000.00, 75.00, '2025-01-03 11:00:00'),
('Smartphone Case', 'Accessories', 50, 'Spigen', 800.00, 10.00, '2025-01-04 12:00:00'),
('Bluetooth Headset', 'Electronics', 25, 'Jabra', 4000.00, 50.00, '2025-01-05 13:00:00'),
('Yoga Mat', 'Fitness', 40, 'Liforme', 1200.00, 15.00, '2025-01-06 14:00:00'),
('Leather Wallet', 'Accessories', 35, 'Tommy Hilfiger', 2000.00, 25.00, '2025-01-07 15:00:00'),
('Digital Watch', 'Electronics', 18, 'Casio', 8000.00, 100.00, '2025-01-08 16:00:00'),
('Formal Shoes', 'Footwear', 22, 'Clarks', 5000.00, 65.00, '2025-01-09 17:00:00'),
('Sunglasses', 'Accessories', 28, 'Ray-Ban', 3200.00, 40.00, '2025-01-10 18:00:00'),
('Backpack', 'Bags', 25, 'Samsonite', 3000.00, 38.00, '2025-01-11 19:00:00');

In [ ]:
--Orders data

insert into Orders (customer_id, order_date, total_amount, status) values
(1, '2025-01-02 10:15:00', 15000.00, 'Courier Ready to Pick'),
(1, '2025-01-02 12:00:00', 15000.00, 'Has Been Picked'),
(1, '2025-01-02 15:30:00', 15000.00, 'Shipped'),
(1, '2025-01-02 18:45:00', 15000.00, 'Out for Delivery'),
(1, '2025-01-02 21:00:00', 15000.00, 'Delivered'),
(2, '2025-01-05 09:20:00', 5000.00, 'Courier Ready to Pick'),
(2, '2025-01-05 10:30:00', 5000.00, 'Cancelled'),
(3, '2025-01-10 11:10:00', 2000.00, 'Pending'),
(4, '2025-02-17 16:20:00', 13500.00, 'Courier Ready to Pick'),
(4, '2025-02-17 18:00:00', 13500.00, 'Has Been Picked'),
(4, '2025-02-18 09:30:00', 13500.00, 'Shipped'),
(4, '2025-02-18 13:15:00', 13500.00, 'Out for Delivery'),
(4, '2025-02-18 16:40:00', 13500.00, 'Delivered'),
(5, '2025-02-26 12:05:00', 160.00, 'Courier Ready to Pick'),
(5, '2025-02-26 14:00:00', 160.00, 'Has Been Picked'),
(5, '2025-02-26 16:30:00', 160.00, 'Cancelled'),
(6, '2025-04-14 08:40:00', 14500.00, 'Courier Ready to Pick'),
(6, '2025-04-14 10:20:00', 14500.00, 'Has Been Picked'),
(6, '2025-04-14 13:00:00', 14500.00, 'Shipped'),
(6, '2025-04-14 16:00:00', 14500.00, 'Out for Delivery'),
(6, '2025-04-14 19:30:00', 14500.00, 'Delivered'),
(7, '2025-04-19 11:55:00', 110.00, 'Pending'),
(8, '2025-05-18 17:10:00', 20000.00, 'Courier Ready to Pick'),
(8, '2025-05-18 18:30:00', 20000.00, 'Has Been Picked'),
(8, '2025-05-19 08:45:00', 20000.00, 'Shipped'),
(9, '2025-05-20 13:25:00', 130.00, 'Courier Ready to Pick'),
(9, '2025-05-20 15:10:00', 130.00, 'Has Been Picked'),
(9, '2025-05-21 10:00:00', 130.00, 'Shipped'),
(9, '2025-05-21 13:30:00', 130.00, 'Out for Delivery'),
(9, '2025-05-21 17:20:00', 130.00, 'Delivered'),
(10, '2025-05-28 19:00:00', 17500.00, 'Cancelled');

In [ ]:
--Order_items data

insert into Order_Items (order_id, product_id, quantity, price) values
(1, 1, 1, 8000.00), (1, 2, 1, 6000.00), (1, 3, 2, 800.00),
(4, 4, 1, 4000.00), (4, 5, 2, 1200.00),
(6, 6, 1, 2000.00), (6, 7, 1, 8000.00), (6, 8, 1, 5000.00),
(8, 1, 1, 8000.00), (8, 9, 1, 3200.00), (8, 10, 1, 3000.00),
(10, 2, 1, 6000.00), (10, 4, 2, 4000.00),
(2, 4, 1, 50.00), (2, 5, 2, 15.00),
(3, 6, 1, 25.00), (3, 7, 1, 100.00), (3, 8, 1, 65.00),
(5, 1, 1, 100.00), (5, 9, 1, 40.00), (5, 10, 1, 38.00),
(7, 2, 1, 75.00), (7, 4, 2, 50.00),
(9, 5, 1, 15.00), (9, 6, 1, 25.00), (9, 10, 1, 38.00);